Revit 2027 API
Rebar.IsCustomSpacingWithPredefinedNumberOfBars Method
 Checks if the layout is defined as a Custom Spacing Layout with a predefined number of bars. Custom Spacing layout will have a predefined number of bars if the formula is fixed (not variable and without percentage members).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCustomSpacingWithPredefinedNumberOfBars()
Public Function IsCustomSpacingWithPredefinedNumberOfBars As Boolean
public:
bool IsCustomSpacingWithPredefinedNumberOfBars()
member IsCustomSpacingWithPredefinedNumberOfBars : unit -> bool
Return Value
Boolean
 Returns true, if the Layout is Custom Spacing and it has a predefined number of bars(the formula is fixed). It will return false if the layout is other than Custom Spacing or if the formula is variable or has percentage members.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace